HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMcdslight_reg.h
/** \brief 994, Action Definition Register 69 */
#define MCDSLIGHT_MCXACT69 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA010994u)

/** \brief 998, Action Definition Register 70 */
#define MCDSLIGHT_MCXACT70 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA010998u)

/** \brief 99C, Action Definition Register 71 */
#define MCDSLIGHT_MCXACT71 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA01099Cu)

/** \brief 9A0, Action Definition Register 72 */
#define MCDSLIGHT_MCXACT72 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0109A0u)

/** \brief 9A4, Action Definition Register 73 */
#define MCDSLIGHT_MCXACT73 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0109A4u)

/** \brief 9A8, Action Definition Register 74 */
#define MCDSLIGHT_MCXACT74 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0109A8u)

/** \brief 9AC, Action Definition Register 75 */
#define MCDSLIGHT_MCXACT75 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0109ACu)

/** \brief 9B0, Action Definition Register 76 */
#define MCDSLIGHT_MCXACT76 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0109B0u)

/** \brief 9B4, Action Definition Register 77 */
#define MCDSLIGHT_MCXACT77 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0109B4u)

/** \brief 9B8, Action Definition Register 78 */
#define MCDSLIGHT_MCXACT78 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0109B8u)

/** \brief 9BC, Action Definition Register 79 */
#define MCDSLIGHT_MCXACT79 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0109BCu)

/** \brief 9C0, Action Definition Register 80 */
#define MCDSLIGHT_MCXACT80 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCXACT*)0xFA0109C0u)

/** \brief A00, Counter Control Register */
#define MCDSLIGHT_MCX0_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010A00u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX0_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX0_CCL.
*/
#define MCDSLIGHT_MCXCCL0 (MCDSLIGHT_MCX0_CCL)

/** \brief A04, Counter Limit Register */
#define MCDSLIGHT_MCX0_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010A04u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX0_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX0_LMT.
*/
#define MCDSLIGHT_MCXLMT0 (MCDSLIGHT_MCX0_LMT)

/** \brief A08, Current Count Register */
#define MCDSLIGHT_MCX0_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010A08u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX0_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX0_CNT.
*/
#define MCDSLIGHT_MCXCNT0 (MCDSLIGHT_MCX0_CNT)

/** \brief A10, Counter Control Register */
#define MCDSLIGHT_MCX1_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010A10u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX1_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX1_CCL.
*/
#define MCDSLIGHT_MCXCCL1 (MCDSLIGHT_MCX1_CCL)

/** \brief A14, Counter Limit Register */
#define MCDSLIGHT_MCX1_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010A14u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX1_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX1_LMT.
*/
#define MCDSLIGHT_MCXLMT1 (MCDSLIGHT_MCX1_LMT)

/** \brief A18, Current Count Register */
#define MCDSLIGHT_MCX1_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010A18u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX1_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX1_CNT.
*/
#define MCDSLIGHT_MCXCNT1 (MCDSLIGHT_MCX1_CNT)

/** \brief A20, Counter Control Register */
#define MCDSLIGHT_MCX2_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010A20u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX2_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX2_CCL.
*/
#define MCDSLIGHT_MCXCCL2 (MCDSLIGHT_MCX2_CCL)

/** \brief A24, Counter Limit Register */
#define MCDSLIGHT_MCX2_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010A24u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX2_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX2_LMT.
*/
#define MCDSLIGHT_MCXLMT2 (MCDSLIGHT_MCX2_LMT)

/** \brief A28, Current Count Register */
#define MCDSLIGHT_MCX2_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010A28u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX2_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX2_CNT.
*/
#define MCDSLIGHT_MCXCNT2 (MCDSLIGHT_MCX2_CNT)

/** \brief A30, Counter Control Register */
#define MCDSLIGHT_MCX3_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010A30u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX3_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX3_CCL.
*/
#define MCDSLIGHT_MCXCCL3 (MCDSLIGHT_MCX3_CCL)

/** \brief A34, Counter Limit Register */
#define MCDSLIGHT_MCX3_LMT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_LMT*)0xFA010A34u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX3_LMT.
* To use register names with standard convension, please use MCDSLIGHT_MCX3_LMT.
*/
#define MCDSLIGHT_MCXLMT3 (MCDSLIGHT_MCX3_LMT)

/** \brief A38, Current Count Register */
#define MCDSLIGHT_MCX3_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CNT*)0xFA010A38u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX3_CNT.
* To use register names with standard convension, please use MCDSLIGHT_MCX3_CNT.
*/
#define MCDSLIGHT_MCXCNT3 (MCDSLIGHT_MCX3_CNT)

/** \brief A40, Counter Control Register */
#define MCDSLIGHT_MCX4_CCL /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_MCX_CCL*)0xFA010A40u)
/** Alias (User Manual Name) for MCDSLIGHT_MCX4_CCL.
* To use register names with standard convension, please use MCDSLIGHT_MCX4_CCL.
*/
#define MCDSLIGHT_MCXCCL4 (MCDSLIGHT_MCX4_CCL)

