HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxMcdslight_reg.h
/** \brief 4510, Comparator Bound Register 1 */
#define MCDSLIGHT_TCYAC1_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_BND*)0xFA014510u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC1_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC1_BND.
*/
#define MCDSLIGHT_TCYACBND1 (MCDSLIGHT_TCYAC1_BND)

/** \brief 4514, Comparator Range Register 1 */
#define MCDSLIGHT_TCYAC1_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_RNG*)0xFA014514u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC1_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC1_RNG.
*/
#define MCDSLIGHT_TCYACRNG1 (MCDSLIGHT_TCYAC1_RNG)

/** \brief 4518, Comparator Mask Register 1 */
#define MCDSLIGHT_TCYAC1_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_MSK*)0xFA014518u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC1_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC1_MSK.
*/
#define MCDSLIGHT_TCYACMSK1 (MCDSLIGHT_TCYAC1_MSK)

/** \brief 4520, Comparator Bound Register 2 */
#define MCDSLIGHT_TCYAC2_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_BND*)0xFA014520u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC2_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC2_BND.
*/
#define MCDSLIGHT_TCYACBND2 (MCDSLIGHT_TCYAC2_BND)

/** \brief 4524, Comparator Range Register 2 */
#define MCDSLIGHT_TCYAC2_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_RNG*)0xFA014524u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC2_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC2_RNG.
*/
#define MCDSLIGHT_TCYACRNG2 (MCDSLIGHT_TCYAC2_RNG)

/** \brief 4528, Comparator Mask Register 2 */
#define MCDSLIGHT_TCYAC2_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_MSK*)0xFA014528u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC2_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC2_MSK.
*/
#define MCDSLIGHT_TCYACMSK2 (MCDSLIGHT_TCYAC2_MSK)

/** \brief 4530, Comparator Bound Register 3 */
#define MCDSLIGHT_TCYAC3_BND /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_BND*)0xFA014530u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC3_BND.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC3_BND.
*/
#define MCDSLIGHT_TCYACBND3 (MCDSLIGHT_TCYAC3_BND)

/** \brief 4534, Comparator Range Register 3 */
#define MCDSLIGHT_TCYAC3_RNG /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_RNG*)0xFA014534u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC3_RNG.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC3_RNG.
*/
#define MCDSLIGHT_TCYACRNG3 (MCDSLIGHT_TCYAC3_RNG)

/** \brief 4538, Comparator Mask Register 3 */
#define MCDSLIGHT_TCYAC3_MSK /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYAC_MSK*)0xFA014538u)
/** Alias (User Manual Name) for MCDSLIGHT_TCYAC3_MSK.
* To use register names with standard convension, please use MCDSLIGHT_TCYAC3_MSK.
*/
#define MCDSLIGHT_TCYACMSK3 (MCDSLIGHT_TCYAC3_MSK)

/** \brief 4580, DTU FIFOs Fill Level */
#define MCDSLIGHT_TCYDTUFLV /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYDTUFLV*)0xFA014580u)

/** \brief 4800, Event Definition Register 0 */
#define MCDSLIGHT_TCYEVT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014800u)

/** \brief 4804, Event Definition Register 1 */
#define MCDSLIGHT_TCYEVT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014804u)

/** \brief 4808, Event Definition Register 2 */
#define MCDSLIGHT_TCYEVT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014808u)

/** \brief 480C, Event Definition Register 3 */
#define MCDSLIGHT_TCYEVT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA01480Cu)

/** \brief 4810, Event Definition Register 4 */
#define MCDSLIGHT_TCYEVT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014810u)

/** \brief 4814, Event Definition Register 5 */
#define MCDSLIGHT_TCYEVT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014814u)

/** \brief 4818, Event Definition Register 6 */
#define MCDSLIGHT_TCYEVT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014818u)

/** \brief 481C, Event Definition Register 7 */
#define MCDSLIGHT_TCYEVT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA01481Cu)

/** \brief 4820, Event Definition Register 8 */
#define MCDSLIGHT_TCYEVT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014820u)

/** \brief 4824, Event Definition Register 9 */
#define MCDSLIGHT_TCYEVT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014824u)

/** \brief 4828, Event Definition Register 10 */
#define MCDSLIGHT_TCYEVT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014828u)

/** \brief 482C, Event Definition Register 11 */
#define MCDSLIGHT_TCYEVT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA01482Cu)

/** \brief 4830, Event Definition Register 12 */
#define MCDSLIGHT_TCYEVT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014830u)

/** \brief 4834, Event Definition Register 13 */
#define MCDSLIGHT_TCYEVT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014834u)

/** \brief 4838, Event Definition Register 14 */
#define MCDSLIGHT_TCYEVT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA014838u)

/** \brief 483C, Event Definition Register 15 */
#define MCDSLIGHT_TCYEVT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYEVT*)0xFA01483Cu)

/** \brief 4880, Action Definition Register 0 */
#define MCDSLIGHT_TCYACT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA014880u)

/** \brief 4884, Action Definition Register 1 */
#define MCDSLIGHT_TCYACT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA014884u)

/** \brief 4888, Action Definition Register 2 */
#define MCDSLIGHT_TCYACT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA014888u)

/** \brief 488C, Action Definition Register 3 */
#define MCDSLIGHT_TCYACT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA01488Cu)

/** \brief 4890, Action Definition Register 4 */
#define MCDSLIGHT_TCYACT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA014890u)

/** \brief 4894, Action Definition Register 5 */
#define MCDSLIGHT_TCYACT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA014894u)

/** \brief 4898, Action Definition Register 6 */
#define MCDSLIGHT_TCYACT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA014898u)

/** \brief 489C, Action Definition Register 7 */
#define MCDSLIGHT_TCYACT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA01489Cu)

/** \brief 48A0, Action Definition Register 8 */
#define MCDSLIGHT_TCYACT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148A0u)

/** \brief 48A4, Action Definition Register 9 */
#define MCDSLIGHT_TCYACT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148A4u)

/** \brief 48A8, Action Definition Register 10 */
#define MCDSLIGHT_TCYACT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MCDSLIGHT_TCYACT*)0xFA0148A8u)

